; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v4 - type_2 ?v7 - type_1)
 	      (pred_3 ?v3 - object ?v7 - type_1)
	      (pred_4 ?v4 - type_2 ?v1 - type_3)
	      (pred_2 ?v4 - type_2 ?v3 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v6 ?v8 - type_1)
       :precondition (and  (pred_1 ?v4 ?v6))
       :effect (and  (pred_1 ?v4 ?v8)
		     (not (pred_1 ?v4 ?v6))))

   (:action op_1
       :parameters (?v4 - type_2 ?v2 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v5) (pred_1 ?v4 ?v5) (pred_4 ?v4 ?v1))
       :effect (and (pred_2 ?v4 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v5)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_2 ?v2 - object ?v5 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v2 ?v1) (pred_1 ?v4 ?v5))
       :effect (and (pred_3 ?v2 ?v5)
		    (pred_4 ?v4 ?v1)
		    (not (pred_2 ?v4 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_07 - type_2
obj_03 obj_12 obj_08 obj_13 - type_3
obj_05 obj_11 obj_14 obj_02 - type_1
obj_06 obj_10 obj_04 obj_01 - object)
(:init
(pred_1 obj_09 obj_02)
(pred_4 obj_09 obj_03)
(pred_4 obj_09 obj_12)
(pred_1 obj_07 obj_02)
(pred_4 obj_07 obj_08)
(pred_4 obj_07 obj_13)
(pred_3 obj_06 obj_11)
(pred_3 obj_10 obj_02)
(pred_3 obj_04 obj_02)
(pred_3 obj_01 obj_14)
)
(:goal
(and
(pred_3 obj_06 obj_11)
(pred_3 obj_10 obj_14)
(pred_3 obj_04 obj_05)
(pred_3 obj_01 obj_11)
)
)

(:constraints
  (always (not (pred_1 obj_09 obj_14)))
)
)

; plan
1. (op_1 obj_09 obj_10 obj_02 obj_12)
   deleted: (pred_3 obj_10 obj_02) (pred_4 obj_09 obj_12)
   added: (pred_2 obj_09 obj_10 obj_12)
   goals met: 1 of 4
2. (op_1 obj_07 obj_04 obj_02 obj_13)
   deleted: (pred_3 obj_04 obj_02) (pred_4 obj_07 obj_13)
   added: (pred_2 obj_07 obj_04 obj_13)
   goals met: 1 of 4
3. (op_3 obj_07 obj_02 obj_05)
   deleted: (pred_1 obj_07 obj_02)
   added: (pred_1 obj_07 obj_05)
   goals met: 1 of 4
4. (op_3 obj_09 obj_02 obj_11)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_11)
   goals met: 1 of 4
5. (op_2 obj_07 obj_04 obj_05 obj_13)
   deleted: (pred_2 obj_07 obj_04 obj_13)
   added: (pred_3 obj_04 obj_05) (pred_4 obj_07 obj_13)
   goals met: 2 of 4
6. (op_2 obj_09 obj_10 obj_11 obj_12)
   deleted: (pred_2 obj_09 obj_10 obj_12)
   added: (pred_3 obj_10 obj_11) (pred_4 obj_09 obj_12)
   goals met: 2 of 4
7. (op_3 obj_07 obj_05 obj_11)
   deleted: (pred_1 obj_07 obj_05)
   added: (pred_1 obj_07 obj_11)
   goals met: 2 of 4
8. (op_3 obj_07 obj_11 obj_14)
   deleted: (pred_1 obj_07 obj_11)
   added: (pred_1 obj_07 obj_14)
   goals met: 2 of 4
9. (op_1 obj_07 obj_01 obj_14 obj_13)
   deleted: (pred_3 obj_01 obj_14) (pred_4 obj_07 obj_13)
   added: (pred_2 obj_07 obj_01 obj_13)
   goals met: 2 of 4
10. (op_3 obj_07 obj_14 obj_11)
   deleted: (pred_1 obj_07 obj_14)
   added: (pred_1 obj_07 obj_11)
   goals met: 2 of 4
11. (op_2 obj_07 obj_01 obj_11 obj_13)
   deleted: (pred_2 obj_07 obj_01 obj_13)
   added: (pred_3 obj_01 obj_11) (pred_4 obj_07 obj_13)
   goals met: 3 of 4
12. (op_1 obj_07 obj_10 obj_11 obj_13)
   deleted: (pred_3 obj_10 obj_11) (pred_4 obj_07 obj_13)
   added: (pred_2 obj_07 obj_10 obj_13)
   goals met: 3 of 4
13. (op_3 obj_07 obj_11 obj_14)
   deleted: (pred_1 obj_07 obj_11)
   added: (pred_1 obj_07 obj_14)
   goals met: 3 of 4
14. (op_2 obj_07 obj_10 obj_14 obj_13)
   deleted: (pred_2 obj_07 obj_10 obj_13)
   added: (pred_3 obj_10 obj_14) (pred_4 obj_07 obj_13)
   goals met: 4 of 4
